//水仙花数：一个三位数，它的每个位上的数字的3次幂之和等于它本身。如：对153， 1^3 + 5^3 + 3^3 = 153
//请设计一个c语言程序，打印出所有1000以内的水仙花数
//100~999

#include <stdio.h>

int main() {
    int i = 100; //起始
    int a = 1, b = 0, c = 0; //初始，分别对应个十百三位
    printf("here are they:");

    while (i < 1000) {  // i=1000就停
        //目标：i每+100,a+1  i每+10,b+1,  i每+1，c+1
        int x = (a*a*a) + (b*b*b) + (c*c*c);  //定义，^符号这里用的时候有问题
        if(i == x) {    //是水仙花数时
            printf("%d\n",x);
        }

        ++i,++c; //每次循环,i与c都+1

        if (c == 10){  // 满10进1
            c = 0, ++b;
        }

        if (b == 10) { // 满10进1
            b = 0; ++a;
        }
    }
}
